# Exercise 4 - Calculating Monthly Statistics

In [1]:
import numpy as np
import pandas as pd

In [2]:
df_etf = pd.read_csv('../data/sector_eft_2018.csv')
df_etf.head()

,symbol,date,open,high,low,close,volume,adjusted,daily_return
0,XLY,2018-01-02,99.110001,100.190002,99.110001,100.190002,4895600,98.949463,0.015199
1,XLY,2018-01-03,100.290001,100.730003,100.269997,100.650002,5319000,99.403770,0.004591
2,XLY,2018-01-04,101.040001,101.110001,100.459999,100.980003,3457400,99.729675,0.003279
3,XLY,2018-01-05,101.430000,101.830002,101.199997,101.779999,4294400,100.519768,0.007922
4,XLY,2018-01-08,101.830002,102.070000,101.699997,101.900002,2670000,100.638283,0.001179

In [3]:
df_etf['symbol'].unique()
df_etf['symbol'].unique().size

10

In [4]:
df_etf.dtypes

symbol           object
date             object
open            float64
high            float64
low             float64
close           float64
volume            int64
adjusted        float64
daily_return    float64
dtype: object

In [5]:
df_etf['date'] = pd.to_datetime(df_etf['date'])

In [6]:
df_etf.dtypes

symbol                  object
date            datetime64[ns]
open                   float64
high                   float64
low                    float64
close                  float64
volume                   int64
adjusted               float64
daily_return           float64
dtype: object

In [7]:
df_etf['year'] = df_etf['date'].dt.year
df_etf['month'] = df_etf['date'].dt.month
df_etf.head()

,symbol,date,open,high,low,close,volume,adjusted,daily_return,year,month
0,XLY,2018-01-02,99.110001,100.190002,99.110001,100.190002,4895600,98.949463,0.015199,2018,1
1,XLY,2018-01-03,100.290001,100.730003,100.269997,100.650002,5319000,99.403770,0.004591,2018,1
2,XLY,2018-01-04,101.040001,101.110001,100.459999,100.980003,3457400,99.729675,0.003279,2018,1
3,XLY,2018-01-05,101.430000,101.830002,101.199997,101.779999,4294400,100.519768,0.007922,2018,1
4,XLY,2018-01-08,101.830002,102.070000,101.699997,101.900002,2670000,100.638283,0.001179,2018,1

In [32]:
df_etf.groupby(['symbol', 'year', 'month']).size().reset_index().head()

  symbol  year  month   0
0    XLB  2018      1  21
1    XLB  2018      2  19
2    XLB  2018      3  21
3    XLB  2018      4  21
4    XLB  2018      5  22

In [17]:
def month_ret(ret):
    return np.prod(1 + ret) - 1

In [19]:
df_etf.groupby(['symbol', 'month', 'year'])['daily_return'].agg([month_ret]).reset_index().head()

  symbol  month  year  month_ret
0    XLB      1  2018   0.039980
1    XLB      2  2018  -0.052740
2    XLB      3  2018  -0.041463
3    XLB      4  2018   0.001229
4    XLB      5  2018   0.020523

In [31]:
pd.options.display.max_rows = 10
df_etf.groupby(['symbol', 'month', 'year'])['daily_return'].agg([lambda x: np.prod(1 + x) - 1]).reset_index()

    symbol  month  year  <lambda>
0      XLB      1  2018  0.039980
1      XLB      2  2018 -0.052740
2      XLB      3  2018 -0.041463
3      XLB      4  2018  0.001229
4      XLB      5  2018  0.020523
..     ...    ...   ...       ...
115    XLY      8  2018  0.051047
116    XLY      9  2018  0.005304
117    XLY     10  2018 -0.101007
118    XLY     11  2018  0.024767
119    XLY     12  2018 -0.079562

[120 rows x 4 columns]

In [26]:
list(map(lambda x: 2*x, [1, 2, 3]))

[2, 4, 6]

In [29]:
list(filter((lambda x: (x%2 != 0)), range(10)))

[1, 3, 5, 7, 9]